INSERT INTO `mydb`.`hotel` (`HotelID`, `City`, `HotelName`, `HotelTele`, `HotelAddress`, `Location`, `ContractStat`, `Memo`) VALUES 
(null, '北京', '北京王府井希尔顿酒店', '010-5812 8888', '北京市东城区王府井东街8号', ST_GeomFromText('POINT(116.41794 39.918007)'), 1, ''),
(null, '北京', '北京希尔顿酒店', '010-58655000', '中国北京市朝阳区东三环北路东方路1号', ST_GeomFromText('POINT (116.46864 39.95857)'), 0, ''),
(null, '北京', '北京首都机场希尔顿酒店', '010-6458 8888', '中国北京市首都机场三号航站楼三经路1号', ST_GeomFromText('POINT (116.599266 40.062485)'), 1, '');

INSERT INTO `mydb`.`restaurant` (`RestaurantID`, `RestaurantName`, `RestaurantTele`, `RestaurantAddress`, `RestaurantOpenTime`, `Introduction`, `AveragePrice`, `Park`, `Smoke`, `Memo`) VALUES
(null, '秦唐中餐厅', '58128888-8411 58128888-8417', '王府井东街8号王府井希尔顿酒店5楼', '11:30 - 14:30，17:30 - 22:00', '作为北京高端专属私人餐厅之一，北京王府井希尔顿酒店秦唐中餐厅，带给客人以最舒适的服务享受。取材于中国历史的大幅壁画给餐厅带来了王宫别院般的视觉效果，造型别致的人性化不锈钢围栏也为宾客提供更多私密性，同时也与四周陈列着的壁画和中式古董相映成趣，构成一个令人心静如水的古朴空间。如此优雅的环境在和传统的古典贵族风格与非凡设计理念及美味佳肴融为一体时，餐厅中的贵族气息，宁谧，纯朴，令您从此对尊贵服务有了新的定义。 您可以选择四间古朴典雅的私人包厢风、生、水、起品尝美味，我们的中餐厨师为您度身定制菜单，营造个性化的用餐体验。配上定制的桌椅家具、巨幅玻璃窗，整个包厢好似一个华丽的古典舞台，这样的就餐体验定会让您难以忘怀。秦唐中餐厅还设有无线上网服务，随时化身成为您的流动办公室。让您在用餐的同时也可以轻松掌握身边的一切信息。每日午餐 | 上午11:30至下午 2:30每日晚餐 | 傍晚 5:30至晚上10:30(晚上10:00为每日最后点餐时间) 餐厅菜单', '244', '', '', ''),
(null, '焰吧扒房', ' 010-58128888', '王府井东街8号王府井希尔顿酒店5楼', '18:00 - 22:30', '焰吧扒房让您在高雅的氛围中品味当代欧式美食经典，同时可透过落地窗俯瞰新老北京的历史与繁华。扒房提供谷物饲养的澳大利亚进口有机牛肉和最新鲜的加拿大海鲜，完美搭配酒店内屡获殊荣的美酒河窖藏的年份葡萄酒，成为王府井地区不可错过的美食新体验。 位于北京王府井希尔顿酒店五层，毗邻焰吧，扒房有着低调又不失优雅的环境，在极具现代感的氛围中透过宽大的落地玻璃窗，古老北京的格调即刻映入您的眼帘，让您感受完美的用餐体验。私密舒适的餐厅可提供36个雅座，分成两个独立的部分。我们的厨师团队以精心挑选的食材，结合精湛的厨艺，竭诚为您带来一次无与伦比的西式餐饮体验。菜单不仅包含各式俱全的上等进口牛排、新鲜海鲜及特色西班牙海鲜饭，丰富多样的餐前小吃及美味甜品也不容错过。每日晚餐 | 傍晚 18:00至晚上10:30餐厅菜单', '472', '', '', ''),
(null, '万斯阁西餐厅', ' 58128888-8412', '王府井东街8号北京王府井希尔顿酒店5楼', '06:30 - 22:30。自助早餐06:30 - 10:30；自助午餐11:30 - 14:30；自助晚餐17:30 - 21:30。', '万斯阁餐厅设计定位于北京最具异国风情和独具个性的美食港口，提供令人放松愉悦的早、中、晚餐和欣赏炫目北京美景的优雅环境。这里拥有140个独具古老澳门特色的座位及开放式厨房，方便客人在享受美味早餐的同时又可欣赏到美食制作的美妙过程。 万斯阁餐厅的出品结合了Hilton无懈可击的高标准餐饮要求及创新餐饮理念。室内设计风格灵感取自旧时澳门的静谧风情，设计表现手法严谨细腻，一如希尔顿品牌的一贯标准。 万斯阁西餐厅的食谱称得上是一幅精美绝伦的全球精粹美食长卷，款款美味极具地域特色和时令特点，将清淡，健康，香嫩诱人等美妙口感巧妙地融入到了每道佳肴。 万斯阁由享誉全球的Wilson公司设计，其在餐厅环境设计领域颇有建树。设计总监Dan Kwan 将其创新的设计理念融入万斯阁餐厅的设计之中，"我希望能为新一代就餐者创造一个全新的餐饮理念，一处可任所有感官惬意放松的海边氛围。" 质感雅致的桌面，宽阔的玻璃窗，灰色大理石花纹地面，独特的起绒粗呢面料和白色水洗木天花板，营造出万斯阁开放、优雅、精致的感觉。每日早餐 | 凌晨 6:30至上午10:30每日午餐 | 上午11:30至下午 2:30每日晚餐 | 傍晚 5:30至晚上11:00(晚上10:30为每日最后点餐时间)周日早午餐 | 每周日12:00至下午3:00  餐厅菜单', '297', '', '', ''),
(null, '东方路一号', ' 010-58655030', '东三环北路东方路1号希尔顿饭店2楼', '午餐12:00至14:30 晚餐18:00至22:30', '酒店的特色美式餐厅“东方路一号”，重新定义了源自美国的现代烹调，餐厅环境亲切，温馨，弥漫着一种怀旧感，令人想起最初的路易斯安娜餐厅里那种美国南方宅第的室内装修风格。餐厅供应世界各地的品牌葡萄酒，在京城首屈一指，您可在品酒师的推荐下品味享用。餐厅的两个别致包间，是商务、家庭聚会的理想场所。 东方路一号零点菜单东方路一号甜点菜单 营业时间：午餐周一至周五、周日：12:00pm - 14:30pm晚餐周一至周日：18:00pm - 22:30pm 预订电话：010-58655030 ', '307', '', '', ''),
(null, '元素阁', ' 010-58655020', '东三环北路东方路1号希尔顿酒店2楼', '全天营业', '开放式厨房餐厅，集中亚洲各式精致佳肴。各种烹调手段一应俱全，如烘、烤、蒸、煮、焙、炸等。富有时代气息的现场厨房概念使顾客有机会观看厨师现场运用包括金、木、水、火、土等元素来创造时尚一流的亚洲佳肴。 元素阁零点菜单 营业时间：早餐 周一至周五 6:00am - 10:00am周六和周日 6:00am - 11:00am午餐 周一至周五 11:30am - 2:30pm周六和周日 12:00pm - 2:30pm晚餐 周一至周五 6:00pm - 10:00pm 预订电话：010-58655020', '234', '', '', ''),
(null, '颐达吧', ' 010-58655050', '东三环北路东方路1号北京希尔顿酒店2楼', '17:00至02:00', '格调幽雅的颐达吧为您营造私密且舒适的环境，提供各式精选的葡萄酒、香槟及招牌鸡尾酒。无论是与朋友度过轻松愉悦的夜晚，亦或寻觅志同道合之新识，颐达吧能带给您无尽享受。 颐达吧酒单  营业时间：18:00pm - 2:00am预订电话：010-58655050', '113', '', '', ''),
(null, '东西风扒房', ' 64588888-8101 010-64504784', '首都机场3号航站楼希尔顿酒店1楼', '17:30 - 23:00', '步入东西风扒房，您会立刻感受到味蕾燃烧的快感。 多种顶级肉类食材和新鲜海鲜一一登场，为您奉上极致美味：正宗牛排、北京烤鸭、日式铁板烧、印度唐杜里风味烧烤美食，均由专业厨师为您现场烹饪。 举杯欢饮，您可品味经典鸡尾酒，或挑选您中意的葡萄酒。餐厅中央的葡萄酒窖，亦是别有特色的包间，与其他四间私密包房一起为您提供无限愉悦的味觉体验。营业时间：周一至周六 17:30 - 21:30位置：首都机场希尔顿酒店 一层预订电话：86 10 64504784', '351', '', '', ''),
(null, '腾香居', ' 64588888-8901 010-64504889', '三经路首都机场3号航站楼希尔顿酒店2楼', '午餐：11:30 - 14:30 晚餐：17:00 - 22:00', '‍‍来到古意浓浓的腾香居，一场融合川菜与湘菜之美的辣味冒险旅程正在等待您。所有美食全部由来自当地的厨师掌勺，家常式的烹饪技艺及有机食材的选择，保证口味绝对地道。所有辣味菜品都有三个级别供您挑选，更贴心地为独自用餐的食客准备了特色套餐。餐厅精心准备了顶极中国茶叶，手艺高超的茶艺师傅将为您现场展示最为精湛的茶道技艺。13间典雅气派的包厢，为你带来私密和温馨享受。‍‍营业时间：11:30 - 14:30                        17:30 - 22:00位置：首都机场希尔顿酒店 二层预订电话：86 10 64504889', '207', '', '', '');

INSERT INTO `mydb`.`picture` (`PictureID`, `FileName`, `PictureIntro`) VALUES
(null, '1839e9f9-f27b-41b9-afff-424a4d1a6a29.jpg', '秦唐中餐厅'),
(null, 'd18a8597-c0de-49c5-ab30-d0f9476674ac.jpg', '秦唐中餐厅'),
(null, 'c81287dc-042a-4674-9bd1-af34d224c496.jpg', '秦唐中餐厅'),

(null, '42097fb4-2d6d-4457-bc09-ed9199cae43e.jpg', '行政主厨和行政副主厨'),
(null, 'a362bf3b-5543-462c-91e1-e7993db3938a.jpg', '焰吧扒房-巧克力黑森林蛋糕'),
(null, 'c42923cb-66f5-4538-a1c4-dc519387b25b.jpg', '焰吧扒房-生片澳洲牛肉'),

(null, 'd4bf0904-d399-4be6-b0d4-9a278fcf5369.jpg', '万斯阁西餐厅'),
(null, 'a086269c-dfd7-4906-b2d6-f6cc43d5357e.jpg', '万斯阁自助餐'),
(null, '71682e55-4cf7-4d13-bcd3-a3bf5fc8a93c.jpg', '万斯阁西餐厅-墨西哥玉米饼'),

(null, 'eb3823f3-fa5e-4b62-bd79-4bd8783cd156.jpg', '东方路一号'),

(null, 'e5a9e55f-1a60-45cc-9357-c342726a6712.jpg', '元素阁'),

(null, '1f980292-f332-4673-b8d7-9ea6e3f4f418.jpg', '颐达吧'),

(null, '9988be05-802d-4317-b8f4-ded405951eea.jpg', '东西风扒房'),
(null, 'f0c7e90c-c4f7-4810-b064-d52c3924c1a2.jpg', ''),
(null, 'b4719455-0198-47a1-9369-92a918a80cd1.jpg', ''),

(null, '5175162a-59f5-4922-a960-79b11f9b57c2.jpg', '腾香居'),
(null, '0e4395cf-e31b-4ee0-a2fe-032545ea26e3.jpg', ''),
(null, '3f25d5a3-6c74-49e0-ab27-9335d8c1fdc9.jpg', '');

INSERT INTO `mydb`.`hotel2restaurant` (`HotelID`, `RestaurantID`) VALUES
(1, 1), (1, 2), (1, 3),
(2, 4), (2, 5), (2, 6),
(3, 7), (3, 8);

INSERT INTO `mydb`.`restaurant2picture` (`RestaurantID`, `PictureID`) VALUES
(1, 1), (1, 2), (1, 3),
(2, 4), (2, 5), (2, 6),
(3, 7), (3, 8), (3, 9),
(4, 10),
(5, 11),
(6, 12),
(7, 13), (7, 14), (7, 15),
(8, 16), (8, 17), (8, 18);